docs: update for understanding
